           IDENTIFICATION DIVISION.
           PROGRAM-ID. CONT.
           PROCEDURE DIVISION.
               DISPLAY "This is a super long line that I'd like to print 
      -        "by breaking it onto a newline".
           END PROGRAM CONT.